{
    "questions": [
      "What are the learning outcomes of the User Interface Design module?",
      "What is the study load in credits for the Project Big Data & AI: PoC module?",
      "What are the assessment objectives/criteria for the Code assessment Software Development module?",
      "What topics are covered in the Programming 2 module?",
      "What is the required minimum score for the API design module?",
      "What is the weighting factor for the Cloud Infrastructure module?",
      "What are the learning outcomes of the Web Development 1 module?",
      "What is the assessment scale for the Business Pitch module?",
      "What is the content of the Web Development 2 module?",
      "What are the details of assessments for the Entrepreneurship & ICT module?",
      "What are the contact hours for strategies and teaching activities for the Project Management 2 module?",
      "What is the content of the Cloud Infrastructure unit of study?",
      "What are the details of assessments for the Presentation API model module?",
      "What are the details of assessments for the Web Development 1 module?",
      "What are the details of assessments for the API testing module?",
      "What are the details of assessments for the Project Management module?",
      "What are the details of assessments for the Web Development 2 module?",
      "What are the learning outcomes of the Project Big Data & AI: PoC module?",
      "What are the learning outcomes of the Programming 1 module?",
      "What are the learning outcomes of the Programming 2 module?",
      "What are the learning outcomes of the Cloud Infrastructure module?",
      "What are the learning outcomes of the Web Development 1 module?",
      "What are the learning outcomes of the Web Development 2 module?",
      "What are the learning outcomes of the Entrepreneurship & ICT module?",
      "What are the learning outcomes of the API design module?",
      "What are the learning outcomes of the API testing module?",
      "What are the learning outcomes of the Project Management module?",
      "What are the learning outcomes of the Software Development module?",
      "What are the learning outcomes of the IT Service Management module?",
      "What are the learning outcomes of the Presentation API model module?"
    ]
  }